siri/siri.wsdl

<?xml version="1.0" encoding="utf-8"?><wsdl:definitions name="SMService" targetNamespace="http://www.kolumbus.no/siri" xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/" xmlns:wsa10="http://www.w3.org/2005/08/addressing" xmlns:wsx="http://schemas.xmlsoap.org/ws/2004/09/mex" xmlns:soap12="http://schemas.xmlsoap.org/wsdl/soap12/" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" xmlns:wsp="http://schemas.xmlsoap.org/ws/2004/09/policy" xmlns:wsap="http://schemas.xmlsoap.org/ws/2004/08/addressing/policy" xmlns:msc="http://schemas.microsoft.com/ws/2005/12/wsdl/contract" xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/08/addressing" xmlns:wsam="http://www.w3.org/2007/05/addressing/metadata" xmlns:wsaw="http://www.w3.org/2006/05/addressing/wsdl" xmlns:tns="http://www.kolumbus.no/siri" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/"><wsdl:types><xsd:schema targetNamespace="http://www.kolumbus.no/siri/Imports"><xsd:import schemaLocation="http://sis.kolumbus.no:90/SMWS/SMService.svc?xsd=xsd0" namespace="http://www.siri.org.uk/siri"/><xsd:import schemaLocation="http://sis.kolumbus.no:90/SMWS/SMService.svc?xsd=xsd1" namespace="http://www.kolumbus.no/siri"/><xsd:import schemaLocation="http://sis.kolumbus.no:90/SMWS/SMService.svc?xsd=xsd2" namespace="http://schemas.microsoft.com/2003/10/Serialization/"/><xsd:import schemaLocation="http://sis.kolumbus.no:90/SMWS/SMService.svc?xsd=xsd3" namespace="http://schemas.datacontract.org/2004/07/System.ServiceModel"/><xsd:import schemaLocation="http://sis.kolumbus.no:90/SMWS/SMService.svc?xsd=xsd4" namespace="http://schemas.datacontract.org/2004/07/System"/><xsd:import schemaLocation="http://sis.kolumbus.no:90/SMWS/SMService.svc?xsd=xsd5" namespace="http://www.ifopt.org.uk/acsb"/></xsd:schema></wsdl:types><wsdl:message name="ISMService_GetStopMonitoring_InputMessage"><wsdl:part name="ServiceRequestInfo" type="q1:ServiceRequestInfo" xmlns:q1="http://www.siri.org.uk/siri"/><wsdl:part name="Request" type="q2:StopMonitoringRequest" xmlns:q2="http://www.siri.org.uk/siri"/><wsdl:part name="RequestExtension" type="tns:ExtensionsStructure"/></wsdl:message><wsdl:message name="ISMService_GetStopMonitoring_OutputMessage"><wsdl:part name="ServiceDeliveryInfo" type="q3:BaseProducerResponse" xmlns:q3="http://www.siri.org.uk/siri"/><wsdl:part name="Answer" type="q4:StopMonitoringDeliveries" xmlns:q4="http://www.siri.org.uk/siri"/><wsdl:part name="AnswerExtension" type="tns:ExtensionsStructure"/></wsdl:message><wsdl:message name="ISMService_GetStopMonitoring_StopMonitoringError_FaultMessage"><wsdl:part name="detail" element="tns:StopMonitoringError"/></wsdl:message><wsdl:message name="ISMService_GetMultipleStopMonitoring_InputMessage"><wsdl:part name="ServiceRequestInfo" type="q5:ServiceRequestInfo" xmlns:q5="http://www.siri.org.uk/siri"/><wsdl:part name="Request" type="q6:StopMonitoringMultipleRequest" xmlns:q6="http://www.siri.org.uk/siri"/><wsdl:part name="RequestExtension" type="tns:ExtensionsStructure"/></wsdl:message><wsdl:message name="ISMService_GetMultipleStopMonitoring_OutputMessage"><wsdl:part name="ServiceDeliveryInfo" type="q7:BaseProducerResponse" xmlns:q7="http://www.siri.org.uk/siri"/><wsdl:part name="Answer" type="q8:StopMonitoringDeliveries" xmlns:q8="http://www.siri.org.uk/siri"/><wsdl:part name="AnswerExtension" type="tns:ExtensionsStructure"/></wsdl:message><wsdl:message name="ISMService_GetMultipleStopMonitoring_StopMonitoringError_FaultMessage"><wsdl:part name="detail" element="tns:StopMonitoringError"/></wsdl:message><wsdl:message name="ISMService_GetCapabilities_InputMessage"><wsdl:part name="Request" type="q9:CapabilitiesRequest" xmlns:q9="http://www.siri.org.uk/siri"/><wsdl:part name="RequestExtension" type="tns:ExtensionsStructure"/></wsdl:message><wsdl:message name="ISMService_GetCapabilities_OutputMessage"><wsdl:part name="Answer" type="q10:CapabilitiesResponse" xmlns:q10="http://www.siri.org.uk/siri"/><wsdl:part name="AnswerExtension" type="tns:ExtensionsStructure"/></wsdl:message><wsdl:message name="ISMService_GetCapabilities_GetCapabilitiesError_FaultMessage"><wsdl:part name="detail" element="tns:GetCapabilitiesError"/></wsdl:message><wsdl:message name="ISMService_CheckStatus_InputMessage"><wsdl:part name="Request" type="q11:BaseRequest" xmlns:q11="http://www.siri.org.uk/siri"/><wsdl:part name="RequestExtension" type="tns:ExtensionsStructure"/></wsdl:message><wsdl:message name="ISMService_CheckStatus_OutputMessage"><wsdl:part name="CheckStatusAnswerInfo" type="q12:BaseProducerResponse" xmlns:q12="http://www.siri.org.uk/siri"/><wsdl:part name="Answer" type="q13:CheckStatusResponse" xmlns:q13="http://www.siri.org.uk/siri"/><wsdl:part name="AnswerExtension" type="tns:ExtensionsStructure"/></wsdl:message><wsdl:message name="ISMService_CheckStatus_CheckStatusError_FaultMessage"><wsdl:part name="detail" element="tns:CheckStatusError"/></wsdl:message><wsdl:message name="ISMService_Subscribe_InputMessage"><wsdl:part name="SubscriptionRequestInfo" type="q14:SubscriptionRequestInfo" xmlns:q14="http://www.siri.org.uk/siri"/><wsdl:part name="Request" type="q15:SubscriptionRequest" xmlns:q15="http://www.siri.org.uk/siri"/><wsdl:part name="RequestExtension" type="tns:ExtensionsStructure"/></wsdl:message><wsdl:message name="ISMService_Subscribe_OutputMessage"><wsdl:part name="SubscriptionAnswerInfo" type="q16:BaseResponse" xmlns:q16="http://www.siri.org.uk/siri"/><wsdl:part name="Answer" type="q17:SubscriptionResponse" xmlns:q17="http://www.siri.org.uk/siri"/><wsdl:part name="AnswerExtension" type="tns:ExtensionsStructure"/></wsdl:message><wsdl:message name="ISMService_Subscribe_SubscriptionError_FaultMessage"><wsdl:part name="detail" element="tns:SubscriptionError"/></wsdl:message><wsdl:message name="ISMService_DeleteSubscription_InputMessage"><wsdl:part name="DeleteSubscriptionInfo" type="q18:BaseRequest" xmlns:q18="http://www.siri.org.uk/siri"/><wsdl:part name="Request" type="q19:TerminateSubscriptionRequest" xmlns:q19="http://www.siri.org.uk/siri"/><wsdl:part name="RequestExtension" type="tns:ExtensionsStructure"/></wsdl:message><wsdl:message name="ISMService_DeleteSubscription_OutputMessage"><wsdl:part name="DeleteSubscriptionAnswerInfo" type="q20:BaseResponse" xmlns:q20="http://www.siri.org.uk/siri"/><wsdl:part name="Answer" type="q21:TerminateSubscriptionResponse" xmlns:q21="http://www.siri.org.uk/siri"/><wsdl:part name="AnswerExtension" type="tns:ExtensionsStructure"/></wsdl:message><wsdl:message name="ISMService_DeleteSubscription_DeleteSubscriptionError_FaultMessage"><wsdl:part name="detail" element="tns:DeleteSubscriptionError"/></wsdl:message><wsdl:portType name="ISMService"><wsdl:operation name="GetStopMonitoring" parameterOrder="ServiceRequestInfo Request RequestExtension ServiceDeliveryInfo Answer AnswerExtension"><wsdl:input wsaw:Action="GetStopMonitoring" message="tns:ISMService_GetStopMonitoring_InputMessage"/><wsdl:output wsaw:Action="http://www.kolumbus.no/siri/ISMService/GetStopMonitoringResponse" message="tns:ISMService_GetStopMonitoring_OutputMessage"/><wsdl:fault wsaw:Action="http://www.kolumbus.no/siri/ISMService/GetStopMonitoringStopMonitoringError" name="StopMonitoringError" message="tns:ISMService_GetStopMonitoring_StopMonitoringError_FaultMessage"/></wsdl:operation><wsdl:operation name="GetMultipleStopMonitoring" parameterOrder="ServiceRequestInfo Request RequestExtension ServiceDeliveryInfo Answer AnswerExtension"><wsdl:input wsaw:Action="GetMultipleStopMonitoring" message="tns:ISMService_GetMultipleStopMonitoring_InputMessage"/><wsdl:output wsaw:Action="http://www.kolumbus.no/siri/ISMService/GetMultipleStopMonitoringResponse" message="tns:ISMService_GetMultipleStopMonitoring_OutputMessage"/><wsdl:fault wsaw:Action="http://www.kolumbus.no/siri/ISMService/GetMultipleStopMonitoringStopMonitoringError" name="StopMonitoringError" message="tns:ISMService_GetMultipleStopMonitoring_StopMonitoringError_FaultMessage"/></wsdl:operation><wsdl:operation name="GetCapabilities" parameterOrder="Request RequestExtension Answer AnswerExtension"><wsdl:input wsaw:Action="GetCapabilities" message="tns:ISMService_GetCapabilities_InputMessage"/><wsdl:output wsaw:Action="http://www.kolumbus.no/siri/ISMService/GetCapabilitiesResponse" message="tns:ISMService_GetCapabilities_OutputMessage"/><wsdl:fault wsaw:Action="http://www.kolumbus.no/siri/ISMService/GetCapabilitiesGetCapabilitiesError" name="GetCapabilitiesError" message="tns:ISMService_GetCapabilities_GetCapabilitiesError_FaultMessage"/></wsdl:operation><wsdl:operation name="CheckStatus" parameterOrder="Request RequestExtension CheckStatusAnswerInfo Answer AnswerExtension"><wsdl:input wsaw:Action="CheckStatus" message="tns:ISMService_CheckStatus_InputMessage"/><wsdl:output wsaw:Action="http://www.kolumbus.no/siri/ISMService/CheckStatusResponse" message="tns:ISMService_CheckStatus_OutputMessage"/><wsdl:fault wsaw:Action="http://www.kolumbus.no/siri/ISMService/CheckStatusCheckStatusError" name="CheckStatusError" message="tns:ISMService_CheckStatus_CheckStatusError_FaultMessage"/></wsdl:operation><wsdl:operation name="Subscribe" parameterOrder="SubscriptionRequestInfo Request RequestExtension SubscriptionAnswerInfo Answer AnswerExtension"><wsdl:input wsaw:Action="Subscribe" message="tns:ISMService_Subscribe_InputMessage"/><wsdl:output wsaw:Action="http://www.kolumbus.no/siri/ISMService/SubscribeResponse" message="tns:ISMService_Subscribe_OutputMessage"/><wsdl:fault wsaw:Action="http://www.kolumbus.no/siri/ISMService/SubscribeSubscriptionError" name="SubscriptionError" message="tns:ISMService_Subscribe_SubscriptionError_FaultMessage"/></wsdl:operation><wsdl:operation name="DeleteSubscription" parameterOrder="DeleteSubscriptionInfo Request RequestExtension DeleteSubscriptionAnswerInfo Answer AnswerExtension"><wsdl:input wsaw:Action="DeleteSubscription" message="tns:ISMService_DeleteSubscription_InputMessage"/><wsdl:output wsaw:Action="http://www.kolumbus.no/siri/ISMService/DeleteSubscriptionResponse" message="tns:ISMService_DeleteSubscription_OutputMessage"/><wsdl:fault wsaw:Action="http://www.kolumbus.no/siri/ISMService/DeleteSubscriptionDeleteSubscriptionError" name="DeleteSubscriptionError" message="tns:ISMService_DeleteSubscription_DeleteSubscriptionError_FaultMessage"/></wsdl:operation></wsdl:portType><wsdl:binding name="BasicHttpBinding_ISMService" type="tns:ISMService"><soap:binding transport="http://schemas.xmlsoap.org/soap/http" style="rpc"/><wsdl:operation name="GetStopMonitoring"><soap:operation soapAction="GetStopMonitoring" style="rpc"/><wsdl:input><soap:body use="literal" namespace="http://www.kolumbus.no/siri"/></wsdl:input><wsdl:output><soap:body use="literal" namespace="http://www.kolumbus.no/siri"/></wsdl:output><wsdl:fault name="StopMonitoringError"><soap:fault name="StopMonitoringError" use="literal"/></wsdl:fault></wsdl:operation><wsdl:operation name="GetMultipleStopMonitoring"><soap:operation soapAction="GetMultipleStopMonitoring" style="rpc"/><wsdl:input><soap:body use="literal" namespace="http://www.kolumbus.no/siri"/></wsdl:input><wsdl:output><soap:body use="literal" namespace="http://www.kolumbus.no/siri"/></wsdl:output><wsdl:fault name="StopMonitoringError"><soap:fault name="StopMonitoringError" use="literal"/></wsdl:fault></wsdl:operation><wsdl:operation name="GetCapabilities"><soap:operation soapAction="GetCapabilities" style="rpc"/><wsdl:input><soap:body use="literal" namespace="http://www.kolumbus.no/siri"/></wsdl:input><wsdl:output><soap:body use="literal" namespace="http://www.kolumbus.no/siri"/></wsdl:output><wsdl:fault name="GetCapabilitiesError"><soap:fault name="GetCapabilitiesError" use="literal"/></wsdl:fault></wsdl:operation><wsdl:operation name="CheckStatus"><soap:operation soapAction="CheckStatus" style="rpc"/><wsdl:input><soap:body use="literal" namespace="http://www.kolumbus.no/siri"/></wsdl:input><wsdl:output><soap:body use="literal" namespace="http://www.kolumbus.no/siri"/></wsdl:output><wsdl:fault name="CheckStatusError"><soap:fault name="CheckStatusError" use="literal"/></wsdl:fault></wsdl:operation><wsdl:operation name="Subscribe"><soap:operation soapAction="Subscribe" style="rpc"/><wsdl:input><soap:body use="literal" namespace="http://www.kolumbus.no/siri"/></wsdl:input><wsdl:output><soap:body use="literal" namespace="http://www.kolumbus.no/siri"/></wsdl:output><wsdl:fault name="SubscriptionError"><soap:fault name="SubscriptionError" use="literal"/></wsdl:fault></wsdl:operation><wsdl:operation name="DeleteSubscription"><soap:operation soapAction="DeleteSubscription" style="rpc"/><wsdl:input><soap:body use="literal" namespace="http://www.kolumbus.no/siri"/></wsdl:input><wsdl:output><soap:body use="literal" namespace="http://www.kolumbus.no/siri"/></wsdl:output><wsdl:fault name="DeleteSubscriptionError"><soap:fault name="DeleteSubscriptionError" use="literal"/></wsdl:fault></wsdl:operation></wsdl:binding><wsdl:service name="SMService"><wsdl:port name="BasicHttpBinding_ISMService" binding="tns:BasicHttpBinding_ISMService"><soap:address location="http://sis.kolumbus.no:90/SMWS/SMService.svc"/></wsdl:port></wsdl:service></wsdl:definitions>